#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем СообщениеТелеграммБоту;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ВКМ_ВыполненныеРаботы.Количество() = 0 Тогда
		
		СтатусЗаявки = Перечисления.ВКМ_СтатусЗаявкиНаОбслуживание.ВКМ_ОжидаетсяВыполнениеРабот;
		
	Иначе
		
		СтатусЗаявки = Перечисления.ВКМ_СтатусЗаявкиНаОбслуживание.ВКМ_ЗаявкаВыполнена;
		
	КонецЕсли;
	
	СообщениеТелеграммБоту = ВКМ_СформироватьСообщениеТелеграммБоту();
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СообщениеТелеграммБоту) Тогда
		
		СообщениеТелеграммБоту = СтрЗаменить(СообщениеТелеграммБоту, "№Заявки", ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Номер));
		
		Если Справочники.ВКМ_УведомленияТелеграмБоту.ДобавитьУведомление(СообщениеТелеграммБоту) = Неопределено Тогда
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Формирование уведомления в справочнике. Запись не создана.", УровеньЖурналаРегистрации.Ошибка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроцентОплатыОтРаботы = ВКМ_ПолучитьПроцентОплатыОтРабот(Дата, ВКМ_Специалист);
	Если ПроцентОплатыОтРаботы = Неопределено Тогда

		ТекстСообщения = СтрШаблон(
			"Документ не проведен. У сотрудника %1 не установлен процент оплаты от выполненных работ.", ВКМ_Специалист);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, , , Отказ);

	КонецЕсли;
	
	ВсегоЧасовКОплатеКлиенту = ВКМ_ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
	СтавкаЧасаПоДоговору = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВКМ_Договор, "ВКМ_СтоимостьЧасаРаботыСпециалиста");
	СуммаКОплатеКлиенту = ВсегоЧасовКОплатеКлиенту * СтавкаЧасаПоДоговору;
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Очистить();
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	// Движения по регистру ВКМ_ВыполненныеСотрудникомРаботы
	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.ВКМ_Сотрудник = ВКМ_Специалист;
	Движение.ВКМ_ЧасовКОплате = ВКМ_ВыполненныеРаботы.Итог("ФактическиПотраченоЧасов");
	Движение.ВКМ_СуммаКОплате = СуммаКОплатеКлиенту * ПроцентОплатыОтРаботы / 100;
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();
	
	ПроверитьЗаполнениеОбъекта(Отказ);
	
	// Проверить табличную часть на предмет заполнения выполненных работ.
	
	Если ВКМ_ВыполненныеРаботы.Количество() = 0 Тогда
		
		Возврат;
	
	КонецЕсли;

	Если Отказ Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	ВсегоЧасовКОплатеКлиенту = ВКМ_ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
	СтавкаЧасаПоДоговору = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВКМ_Договор, "ВКМ_СтоимостьЧасаРаботыСпециалиста");
	СуммаКОплатеКлиенту = ВсегоЧасовКОплатеКлиенту * СтавкаЧасаПоДоговору;
	
	// Движения по регистру BKM_ВыполненныеКлиентуРаботы 
	Движение = Движения.BKM_ВыполненныеКлиентуРаботы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.ВКМ_Клиент = ВКМ_Клиент;
	Движение.ВКМ_Договор = ВКМ_Договор;
	Движение.КоличествоЧасов = ВсегоЧасовКОплатеКлиенту;
	Движение.СуммаКОплате = СуммаКОплатеКлиенту;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Задание "Обслуживание клиентов", 8 пункт
Процедура ПроверитьЗаполнениеОбъекта(Отказ)

	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВКМ_Договор,
		"ВидДоговора, ВКМ_ДатаНачалаДействияДоговора, ВКМ_ДатаОкончанияДействияДоговора");
	
	// Проверка вида договора
	Если РеквизитыДоговора.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда

		ТекстСообщения = "Документ не проведен. Выбранный договор не предусматривает абонентского обслуживания.";

		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "ВКМ_Договор", "Объект", Отказ);

	Иначе
		
		// Проверка действия договора
		Если РеквизитыДоговора.ВКМ_ДатаНачалаДействияДоговора > Дата Или РеквизитыДоговора.ВКМ_ДатаОкончанияДействияДоговора < Дата Тогда
			
			ТекстСообщения = "Документ не проведен. Выбранный договор не действителен на дату составления текущего документа.";
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "ВКМ_Договор", "Объект", Отказ);
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВКМ_ПолучитьПроцентОплатыОтРабот(Дата, Специалист)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&ДатаДокумента, ВКМ_Сотрудник = &Сотрудник) КАК
	|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.ПроцентОтРабот;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;

КонецФункции

Функция ВКМ_СформироватьСообщениеТелеграммБоту()
	
	ТекстСообщения = "";
	Если ЭтоНовый() Тогда
		
		ТекстСообщения = "Создана новая заявка на обслуживание клиента";
		
	Иначе
		
		СтарыеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ДатаПроведенияРабот, ВремяНачалаРабот, ВремяОкончанияРабот, Специалист");
		
		ИзмененныеРеквизиты = Новый Структура;
		ИзмененныеРеквизиты.Вставить("ДатаПроведенияРабот", ВКМ_ДатаПроведенияРабот);
		ИзмененныеРеквизиты.Вставить("ВремяНачалаРабот", ВКМ_ВремяНачалаРабот);
		ИзмененныеРеквизиты.Вставить("ВремяОкончанияРабот", ВКМ_ВремяОкончанияРабот);
		ИзмененныеРеквизиты.Вставить("Специалист", ВКМ_Специалист);
		
		Если  Не ОбщегоНазначения.ДанныеСовпадают(СтарыеРеквизиты, ИзмененныеРеквизиты) Тогда
			
			ТекстСообщения = "Произошли изменения в заявке на обслуживание клиента";
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если ТекстСообщения <> "" Тогда
		
		ТекстСообщения = СтрШаблон("%1 №№Заявки от %2.
						|Контрагент %3.
						|Дата проведения работ запланирована на %4 с %5 по %6.
						|Назначен специалист: %7.",
						ТекстСообщения, 
						Формат(Дата,"ДФ=dd.MM.yyyy"), ВКМ_Клиент, Формат(ВКМ_ДатаПроведенияРабот,"ДФ=dd.MM.yyyy"),
						Формат(ВКМ_ВремяНачалаРабот,"ДФ=ЧЧ.мм"),Формат(ВКМ_ВремяОкончанияРабот,"ДФ=ЧЧ.мм"), ВКМ_Специалист);
		
	КонецЕсли;
	
    Возврат ТекстСообщения;
			
КонецФункции

#КонецОбласти

#КонецЕсли

