#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных


#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверитьЗаполнениеОбъекта(Отказ);
	
	// Проверить табличную часть на предмет заполнения выполненных работ.
	
	Если ВКМ_ВыполненныеРаботы.Количество() = 0 Тогда
		
		Возврат;
	
	КонецЕсли;
	
	Если Отказ Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	ВсегоЧасовКОплатеКлиенту = ВКМ_ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
	СтавкаЧасаПоДоговору = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВКМ_Договор, "ВКМ_СтоимостьЧасаРаботыСпециалиста");
	СуммаКОплатеКлиенту = ВсегоЧасовКОплатеКлиенту * СтавкаЧасаПоДоговору;
	
	//Движения по регистру BKM_ВыполненныеКлиентуРаботы 
	Движение = Движения.BKM_ВыполненныеКлиентуРаботы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.ВКМ_Клиент = ВКМ_Клиент;
	Движение.ВКМ_Договор = ВКМ_Договор;
	Движение.КоличествоЧасов = ВсегоЧасовКОплатеКлиенту;
	Движение.СуммаКОплате = СуммаКОплатеКлиенту;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗаполнениеОбъекта(Отказ)

	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВКМ_Договор,
		"ВидДоговора, ВКМ_ДатаНачалаДействияДоговора, ВКМ_ДатаОкончанияДействияДоговора");
	
	// Проверка вида договора
	Если РеквизитыДоговора.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда

		ТекстСообщения = "Документ не проведен. Выбранный договор не предусматривает абонентского обслуживания.";

		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "ВКМ_Договор", "Объект", Отказ);

	Иначе
		
		// Проверка действия договора
		Если РеквизитыДоговора.ВКМ_ДатаНачалаДействияДоговора > Дата Или РеквизитыДоговора.ВКМ_ДатаОкончанияДействияДоговора < Дата Тогда
			
			ТекстСообщения = "Документ не проведен. Выбранный договор не действителен на дату составления текущего документа.";
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "ВКМ_Договор", "Объект", Отказ);
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли